function Probability;
clc,close 

%%%%%%%%%%%%%%%%%%%%%%%%
global A
A = [-1,0,0,0,0,0,0,0;
1,-1,0,0,0,0,0,0;
0,1,-1,0,0,0,0,0;
0,0,1,-1,0,0,0,0;
0,0,0,1,-1,0,0,0;
0,0,0,0,1,-1,0,0;
0,0,0,0,0,1,-1,0;
0,0,0,0,0,0,1,0];

global B
B = [0,1,0,0,0,0,0,0;
0,-1,1,0,0,0,0,0;
0,0,-1,1,0,0,0,0;
0,0,0,-1,1,0,0,0;
0,0,0,0,-1,1,0,0;
0,0,0,0,0,-1,1,0;
0,0,0,0,0,0,-1,1;
0,0,0,0,0,0,0,-1];
%% Численное интегрирование дифф. уравнений
P0 = [1;0;zeros(length(A)-2,1)];
T = [0,500];
[t,P] = ode23(@cmo, T, P0);
tr = t' ;
atr = length(tr)

coeff = [0,0,0,0,0,0,0,0;
    0,1,0,0,0,0,0,0;
    0,0,2,0,0,0,0,0;
    0,0,0,3,0,0,0,0;
    0,0,0,0,4,0,0,0;
    0,0,0,0,0,5,0,0;
    0,0,0,0,0,0,6,0;
    0,0,0,0,0,0,0,7;];

Pnew = P * coeff;
S = sum(Pnew,2);

%plot(t, P), grid, hold on 

%% Построение диаграммы вероятностей состояний
%% line(t,P,'linew',2) %% с различными цветами
line(t,P(:,1),'linew',2, 'color','r') %% Po
line(t,P(:,2), 'linew',2,'lines','--') %% P1
line(t,P(:,3), 'linew',2,'lines','-.') %% P2
line(t,P(:,4), 'linew',2,'lines',':') %% P3
line(t,P(:,5), 'marker','o', 'color', 'm') %% P4
line(t,P(:,6), 'marker','h', 'color','k') %% P5
line(t,P(:,7), 'marker','p','color','r') %% P6
line(t,P(:,8), 'marker','>') %% P7
grid on



N = length(A)-1;
arr = [0:N]';
str = num2str(arr);
legend(strcat('\bf\itP\rm\bf_', str, '(\itt\rm\bf)'));
xlabel('t')%временной интервал
ylabel('P(t)'); %вероятность




function f = cmo(t,P);
%% Функция описания правых частей 
%% дифференциальных уравнений
global A
global B
lambda = 0.2;
f = (lambda*A+nu(t)*B)*P;
